var mon =
[
	["An toàn cơ sở dữ liệu-1-24 (A1904)", 2, "28/10/2024", "10/11/2024", "10->12"],
	["An toàn cơ sở dữ liệu-1-24 (A1904)", 4, "28/10/2024", "10/11/2024", "10->12"],
	["An toàn cơ sở dữ liệu-1-24 (A1904)", 2, "11/11/2024", "05/01/2025", "10->12"],
	["An toàn cơ sở dữ liệu-1-24 (A1901)", 2, "28/10/2024", "10/11/2024", "1->3"],
	["An toàn cơ sở dữ liệu-1-24 (A1901)", 4, "28/10/2024", "10/11/2024", "1->3"],
	["An toàn cơ sở dữ liệu-1-24 (A1901)", 2, "11/11/2024", "05/01/2025", "1->3"],
	["An toàn cơ sở dữ liệu-1-24 (A1903)", 2, "28/10/2024", "10/11/2024", "4->6"],
	["An toàn cơ sở dữ liệu-1-24 (A1903)", 4, "28/10/2024", "10/11/2024", "4->6"],
	["An toàn cơ sở dữ liệu-1-24 (A1903)", 2, "11/11/2024", "05/01/2025", "4->6"],
	["An toàn cơ sở dữ liệu-1-24 (A1902)", 2, "28/10/2024", "10/11/2024", "7->9"],
	["An toàn cơ sở dữ liệu-1-24 (A1902)", 4, "28/10/2024", "10/11/2024", "7->9"],
	["An toàn cơ sở dữ liệu-1-24 (A1902)", 2, "11/11/2024", "05/01/2025", "7->9"],
	["An toàn cơ sở dữ liệu-1-24 (A1905)", 5, "28/10/2024", "10/11/2024", "1->3"],
	["An toàn cơ sở dữ liệu-1-24 (A1905)", 6, "28/10/2024", "10/11/2024", "1->3"],
	["An toàn cơ sở dữ liệu-1-24 (A1905)", 6, "11/11/2024", "05/01/2025", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 2, "12/08/2024", "01/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 4, "12/08/2024", "01/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 4, "02/09/2024", "08/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 2, "09/09/2024", "15/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 4, "09/09/2024", "15/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 2, "16/09/2024", "22/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 4, "16/09/2024", "22/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D604)", 2, "23/09/2024", "13/10/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 2, "12/08/2024", "01/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 4, "12/08/2024", "01/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 4, "02/09/2024", "08/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 2, "09/09/2024", "15/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 4, "09/09/2024", "15/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 2, "16/09/2024", "22/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 4, "16/09/2024", "22/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D601)", 2, "23/09/2024", "13/10/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 2, "12/08/2024", "01/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 4, "12/08/2024", "01/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 4, "02/09/2024", "08/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 2, "09/09/2024", "15/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 4, "09/09/2024", "15/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 2, "16/09/2024", "22/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 4, "16/09/2024", "22/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D603)", 2, "23/09/2024", "13/10/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 2, "12/08/2024", "01/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 4, "12/08/2024", "01/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 4, "02/09/2024", "08/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 2, "09/09/2024", "15/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 4, "09/09/2024", "15/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 2, "16/09/2024", "22/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 4, "16/09/2024", "22/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D602)", 2, "23/09/2024", "13/10/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D608)", 3, "12/08/2024", "15/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D608)", 5, "12/08/2024", "15/09/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D608)", 3, "16/09/2024", "13/10/2024", "10->12"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D605)", 3, "12/08/2024", "15/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D605)", 5, "12/08/2024", "15/09/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D605)", 3, "16/09/2024", "13/10/2024", "1->3"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D607)", 3, "12/08/2024", "15/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D607)", 5, "12/08/2024", "15/09/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D607)", 3, "16/09/2024", "13/10/2024", "4->6"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D606)", 3, "12/08/2024", "15/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D606)", 5, "12/08/2024", "15/09/2024", "7->9"],
	["Cấu trúc dữ liệu và giải thuật-1-24 (A19C7D606)", 3, "16/09/2024", "13/10/2024", "7->9"],

  [
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C702)",
		70,
		"12/08/2024",
		"01/09/2024",
		"(1)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(2)->Thứ 4 tiết 10,11,12 (LT)->(3)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(4)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(5)->Thứ 2 tiết 10,11,12 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C703)",
		70,
		"12/08/2024",
		"01/09/2024",
		"(1)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(2)->Thứ 4 tiết 1,2,3 (LT)->(3)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(4)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(5)->Thứ 2 tiết 1,2,3 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C701)",
		70,
		"12/08/2024",
		"01/09/2024",
		"(1)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(2)->Thứ 4 tiết 4,5,6 (LT)->(3)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(4)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(5)->Thứ 2 tiết 4,5,6 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C704)",
		70,
		"12/08/2024",
		"01/09/2024",
		"(1)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(2)->Thứ 4 tiết 7,8,9 (LT)->(3)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(4)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(5)->Thứ 2 tiết 7,8,9 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C706)",
		70,
		"12/08/2024",
		"15/09/2024",
		"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C707)",
		70,
		"12/08/2024",
		"15/09/2024",
		"(1)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C705)",
		70,
		"12/08/2024",
		"15/09/2024",
		"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)"
],
[
		"Hệ quản trị cơ sở dữ liệu-1-24 (A19C708)",
		70,
		"12/08/2024",
		"15/09/2024",
		"(1)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)"
],

[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D608)",
	70,
	"12/08/2024",
	"01/09/2024",
	"(1)->Thứ 2 tiết 10,11,12 (LT)->(2)->Thứ 2 tiết 10,11,12 (LT)->(3)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(4)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D605)",
	70,
	"12/08/2024",
	"01/09/2024",
	"(1)->Thứ 2 tiết 1,2,3 (LT)->(2)->Thứ 2 tiết 1,2,3 (LT)->(3)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(4)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D607)",
	70,
	"12/08/2024",
	"01/09/2024",
	"(1)->Thứ 2 tiết 4,5,6 (LT)->(2)->Thứ 2 tiết 4,5,6 (LT)->(3)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(4)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D606)",
	70,
	"12/08/2024",
	"01/09/2024",
	"(1)->Thứ 2 tiết 7,8,9 (LT)->(2)->Thứ 2 tiết 7,8,9 (LT)->(3)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(4)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D604)",
	70,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 5 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D601)",
	70,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 5 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D603)",
	70,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 5 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D602)",
	70,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 5 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D609)",
	60,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Kỹ thuật truyền số liệu-1-24 (A19C7D610)",
	60,
	"12/08/2024",
	"06/10/2024",
	"(1)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)"
],

[
	"Lập trình hướng đối tượng-1-24 (A19C7D602)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(2)->Thứ 2 tiết 10,11,12 (LT)->(3)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->(4)->Thứ 2 tiết 10,11,12 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D603)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(2)->Thứ 2 tiết 1,2,3 (LT)->(3)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(4)->Thứ 2 tiết 1,2,3 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D601)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(2)->Thứ 2 tiết 4,5,6 (LT)->(3)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->(4)->Thứ 2 tiết 4,5,6 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D604)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(2)->Thứ 2 tiết 7,8,9 (LT)->(3)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(4)->Thứ 2 tiết 7,8,9 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D610)",
	60,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(4)->Thứ 4 tiết 10,11,12 (LT)->(5)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D609)",
	60,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 6 tiết 1,2,3 (LT)->(3)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(4)->Thứ 4 tiết 1,2,3 (LT)->(5)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D608)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D607)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D605)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)"
],
[
	"Lập trình hướng đối tượng-1-24 (A19C7D606)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)"
],

[
	"Linux và phần mềm nguồn mở-1-24 (A19C705)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(2)->Thứ 2 tiết 1,2,3 (LT)->(3)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->(4)->Thứ 2 tiết 1,2,3 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C708)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(2)->Thứ 2 tiết 7,8,9 (LT)->(3)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->(4)->Thứ 2 tiết 7,8,9 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C706)",
	70,
	"28/10/2024",
	"17/11/2024",
	"(1)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(4)->Thứ 4 tiết 10,11,12 (LT)->(5)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C704)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C701)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C707)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C703)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)"
],
[
	"Linux và phần mềm nguồn mở-1-24 (A19C702)",
	70,
	"28/10/2024",
	"24/11/2024",
	"(1)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)"
],

[
	"Nguyên lý hệ điều hành-1-24 (A19C704)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C701)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 3 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(3)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C703)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(3)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C702)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 3 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(3)->Thứ 6 tiết 7,8,9 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C708)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C705)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(3)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C707)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(3)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Nguyên lý hệ điều hành-1-24 (A19C706)",
	70,
	"12/08/2024",
	"08/09/2024",
	"(1)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(3)->Thứ 6 tiết 7,8,9 (LT)"
],

[
	"Nhập môn mật mã học-1-24 (A1904)",
	70,
	"28/10/2024",
	"10/11/2024",
	"(1)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 6 tiết 10,11,12 (LT)->(4)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(5)->Thứ 4 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(6)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Nhập môn mật mã học-1-24 (A1901)",
	70,
	"28/10/2024",
	"10/11/2024",
	"(1)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(3)->Thứ 6 tiết 1,2,3 (LT)->(4)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(5)->Thứ 4 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(6)->Thứ 5 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Nhập môn mật mã học-1-24 (A1903)",
	70,
	"28/10/2024",
	"10/11/2024",
	"(1)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(3)->Thứ 6 tiết 4,5,6 (LT)->(4)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(5)->Thứ 4 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(6)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Nhập môn mật mã học-1-24 (A1905)",
	70,
	"28/10/2024",
	"10/11/2024",
	"(1)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 2 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(3)->Thứ 2 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Nhập môn mật mã học-1-24 (A1902)",
	70,
	"28/10/2024",
	"10/11/2024",
	"(1)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(3)->Thứ 6 tiết 7,8,9 (LT)->(4)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(5)->Thứ 4 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(6)->Thứ 5 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)"
],

[
	"Tiếng Anh 3-1-24 (A19C7D601)",
	50,
	"12/08/2024",
	"01/09/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(3)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D611)",
	50,
	"12/08/2024",
	"13/10/2024",
	"Thứ 3 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D606)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(3)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(4)->Thứ 2 tiết 10,11,12 (LT)->Thứ 4 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D607)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(3)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(4)->Thứ 2 tiết 1,2,3 (LT)->Thứ 4 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D605)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(3)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(4)->Thứ 2 tiết 4,5,6 (LT)->Thứ 4 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D608)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(3)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(4)->Thứ 2 tiết 7,8,9 (LT)->Thứ 4 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D610)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->(3)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D602)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)->(2)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->(3)->Thứ 3 tiết 10,11,12 (LT)->Thứ 5 tiết 10,11,12 (LT)->Thứ 6 tiết 10,11,12 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D603)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)->(2)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->(3)->Thứ 3 tiết 1,2,3 (LT)->Thứ 5 tiết 1,2,3 (LT)->Thứ 6 tiết 1,2,3 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D609)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)->(2)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->(3)->Thứ 3 tiết 4,5,6 (LT)->Thứ 5 tiết 4,5,6 (LT)->Thứ 6 tiết 4,5,6 (LT)"
],
[
	"Tiếng Anh 3-1-24 (A19C7D604)",
	50,
	"12/08/2024",
	"25/08/2024",
	"(1)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)->(2)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->(3)->Thứ 3 tiết 7,8,9 (LT)->Thứ 5 tiết 7,8,9 (LT)->Thứ 6 tiết 7,8,9 (LT)"
]

]